BusinessProcesses/БизнесПроцессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<BusinessProcess>
		<Properties>
			<Name>БизнесПроцессы</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Task>Task.Мероприятие</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыОперацийБП</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБПНаименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыОперацийБП</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БПРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаНаВыполнение</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.БизнесПроцессы</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапускБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРодитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеСтрелки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРодитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗапущенныеСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРодитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодсказкиМероприятий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ИнициаторыСобытийДляДопСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ИнициаторыСобытийДляДопСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъектыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостоянияПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/БизнесПроцессы/Ext/ObjectModule.bsl
Процедура ЗапуститьБизнесПроцесс(Отказ) Экспорт
	ФункционалБП.ЗапуститьБизнесПроцессБП(Отказ, ЭтотОбъект);
КонецПроцедуры

Процедура ЗапуститьБизнесПроцессСТочки(Отказ, ТСТочка, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСМассив, 
		ТСИсполнитель) Экспорт
	ФункционалБП.ЗапуститьБизнесПроцессСТочкиБП(Отказ, ТСТочка, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСМассив, 
			ТСИсполнитель, ЭтотОбъект);
КонецПроцедуры

Процедура ЗавершитьБизнесПроцесс(Отказ, ЭлементВыход) Экспорт
	ФункционалБП.ЗавершитьБизнесПроцессБП(Отказ, ЭлементВыход, ЭтотОбъект);
КонецПроцедуры

Процедура ПродолжитьВыполнениеБП(Отказ, ИсточникСобытия = Неопределено) Экспорт
	ФункционалБП.ПродолжитьВыполнениеБПБП(Отказ, ИсточникСобытия, ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Отрабатывает, когда заполняем по кнопке "На основании".
	ЭтотОбъект.Объект = ДанныеЗаполнения;
	
	// Отрабатывает когда уже есть бизнес- процессы и Выборка попадает на Исполнительный документ, который
	// не интересует, а интересует его владелец, т.е Долговое обязательство.
	Попытка
		Если ТипЗнч(ДанныеЗаполнения.Объект[0].Владелец) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			ЭтотОбъект.Объект = ДанныеЗаполнения.Объект[0].Владелец;		
		КонецЕсли;	
	Исключение
	КонецПопытки;

	// Отрабатывает, когда первый раз создаём БП, а также когда выборка попадает на Долговое обязательство,
	// а не на Исполнительные документы.
	Попытка
		Если ТипЗнч(ДанныеЗаполнения.Объект[0]) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда 
			ЭтотОбъект.Объект = ДанныеЗаполнения.Объект[0];		
		КонецЕсли;
	Исключение
	КонецПопытки;                                                      	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ФункционалБП.ПередУдалениемБП(Отказ, ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//
	Справочники.ФункцииДополнительныхСвойств.ПроставитьЗначенияДопСвойств(ЭтотОбъект, 
			Перечисления.ИнициаторыСобытийДляДопСвойств.БизнесПроцесс);
КонецПроцедуры

Процедура ПродолжитьВыполнениеБП2(Отказ) Экспорт
	ФункционалБП.ПродолжитьВыполнениеБПБП2(Отказ, ЭтотОбъект);
КонецПроцедуры
